Autodesk.Revit.DB.DividedPath.Flip
Toggle the flipped value
Since:
2013

Autodesk.Revit.DB.DividedPath.IsIntersectorValidForDividedPath(Autodesk.Revit.DB.ElementId)
This returns true if the intersector is an element that can be used to intersect with the divided path.
Remarks:
Intersectors can be curve elements, datum planes, or other divided paths.
Note that divided paths that have this divided path as an intersector
(either directly, or recursively) are not valid.
Also, if the nesting of divided path intersectors that have intersectors is more than 5 levels deep
the divided path intersector is considered invalid as well.
intersector:
The intersector.
Returns:
True if the reference can be used to create a divided path, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.DividedPath.SetIntersectingElements(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Set the elements whose intersection with path produces points.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not all intersecting elements in intersectors are valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.DividedPath.GetIntersectingElements
Get the elements whose intersection with path produces points.
Since:
2013

Autodesk.Revit.DB.DividedPath.IsValidSpacingRuleJustification(Autodesk.Revit.DB.SpacingRuleJustification)
Checks that the justification enumeration value is valid
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.DividedPath.IsValidEndIndent(System.Double)
Checks that the indent value does not cause the beginningIndent and endIndent to overlop
Since:
2013

Autodesk.Revit.DB.DividedPath.IsValidBeginningIndent(System.Double)
Checks that the indent value does not cause the beginningIndent and endIndent to overlop
Since:
2013

Autodesk.Revit.DB.DividedPath.IsValidFixedNumberOfPoints(System.Int32)
Identifies if the indicated number of points is valid for assignment
to a DividedPath with a layout type 'FixedNumber'.
Since:
2013

Autodesk.Revit.DB.DividedPath.IsValidMeasurementType(Autodesk.Revit.DB.DividedPathMeasurementType)
Checks that the measurement type enumeration value is valid
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.DividedPath.IsValidSpacingRuleLayout(Autodesk.Revit.DB.SpacingRuleLayout)
Checks that the spacing rule layout enumeration value is valid
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.DividedPath.IsIntersectorValidForCreation(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
This returns true if the intersector is an element that can be used to intersect with a newly created divided path.
Remarks:
Intersectors can be curve elements, datum planes, or divided paths.
This function is should not be used to validate the input to SetIntersectors()
because it does not check for self intersection of any other circular dependencies between intersectors.
Use isIntersectorValidForDividedPath() instead.
document:
The document.
intersector:
The intersector.
Returns:
True if the reference can be used to create a divided path, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.DividedPath.AreCurveReferencesConnected(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.Reference})
This checks if the references represent a connected set of curves as required by the divided path.
document:
The document.
curveReferences:
The references.
Returns:
True if the arguments passed the checks, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.DividedPath.IsCurveReferenceValid(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Reference)
This returns true if the reference represents a curve or edge that can be used to create a divided path.
document:
The document.
curveReference:
The reference.
Returns:
True if the reference can be used to create a divided path, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.DividedPath.SeparateReferencesIntoConnectedReferences(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.Reference})
This function separates the input curve references into groups of connected curve references.
Each group of connected curve references can be used to create a divided path.
document:
The document.
curveReferences:
The references.
Returns:
The grouped references
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not all curve references in curveReferences represent a curve or an edge
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
this operation failed.
Since:
2013

Autodesk.Revit.DB.DividedPath.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.Reference},System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Creates a new instance of a divided path whose points are determined by the intersecting elements.
Remarks:
Intersectors can be curve elements, datum planes, or other divided paths.
document:
The document.
curveReferences:
References that represent a connected set of curves or edges.
intersectors:
Elements whose intersection with the curve references result in additional divisions.
Returns:
The newly created divided path.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The document does not allow creation of a divided path.
-or-
Not all curve references in curveReferences represent a curve or an edge
-or-
The references in curveReferences are not connected.
-or-
Not all intersecting elements in intersectors are valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2013

Autodesk.Revit.DB.DividedPath.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.Reference})
Creates a new instance of a divided path with a default layout.
document:
The document.
curveReferences:
References that represent a connected set of curves or edges.
Returns:
The newly created divided path.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The document does not allow creation of a divided path.
-or-
Not all curve references in curveReferences represent a curve or an edge
-or-
The references in curveReferences are not connected.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2013

Autodesk.Revit.DB.DividedPath.DisplayReferenceCurves
Controls whether the curves in the path are visible
Remarks:
If true the references that represent the curves will not be hidden.
If false the references that represent the curves may be hidden
Only references that are curve elements can be hidden
If multiple divided paths reference a curve element
then the curve element is not hidden unless all divided paths request that it be hidden.
Since:
2013

Autodesk.Revit.DB.DividedPath.Flipped
If the divided path is flipped the nodes are numbered in the reverse order.
It also switches the ends from which beginningIndent and endIndent are measured from.
Since:
2013

Autodesk.Revit.DB.DividedPath.NumberOfPoints
The total number of points of the divided surface.
This combines the layout points and the intersection points.
Since:
2013

Autodesk.Revit.DB.DividedPath.SpacingRuleJustification
When the layout is set to 'FixedDistance' the points may not cover the
entire range of the path.  The justification determines whether
the points are centered on the range, or shifted towards the start or end of the range.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: Invalid justification
-or-
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.DividedPath.SpacingRuleLayout
The layout determines how points are distributed along the path.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: Invalid layout
-or-
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.DividedPath.IsCyclical
True if the first and last point coincide
False otherwise.
Since:
2013

Autodesk.Revit.DB.DividedPath.IsClosedLoop
Whether or not the path forms a closed loop.
Remarks:
True if the path form a closed loop.
False otherwise.
Since:
2013

Autodesk.Revit.DB.DividedPath.TotalPathLength
The sum of the curve lengths.
Since:
2013

Autodesk.Revit.DB.DividedPath.DisplayNodeNumbers
Controls whether the node numbers are shown when the divided path is selected
Remarks:
If true the divided path will show the number of each node
when the divided path is selected.
If false the node numbers are hidden.
Since:
2013

Autodesk.Revit.DB.DividedPath.DisplayNodes
Controls whether the points of the divided path are visible
Remarks:
If true the nodes of the divided path are visible.
If false the nodes are hidden.
Since:
2013

Autodesk.Revit.DB.DividedPath.EndIndent
The endIndent is an offset distance from the end of the
last curve that determines the end of the range over which
the layout is applied.
The measurement type determines how the distance is measured.
Remarks:
BeginningIndent and endIndent are not allowed to overlap
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for endIndent must be between 0 and 30000 feet.
-or-
When setting this property: endIndent overlaps with beginningIndent
Since:
2013

Autodesk.Revit.DB.DividedPath.BeginningIndent
The beginningIndent is an offset distance from the beginning of the
first curve that determines the beginning of the range over which
the layout is applied.
The measurement type determines how the distance is measured.
Remarks:
BeginningIndent and endIndent are not allowed to overlap
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for beginningIndent must be between 0 and 30000 feet.
-or-
When setting this property: beginningIndent overlaps with endIndent
Since:
2013

Autodesk.Revit.DB.DividedPath.MaximumDistance
The maximum distance is used when the layout is set to 'MaximumSpacing'.
When that layout rule is used the distance between points will not exceed this value.
The measurement type determines how the distance is measured.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The maximumDistance is too small.
Since:
2013

Autodesk.Revit.DB.DividedPath.MinimumDistance
The minimum distance is used when the layout is set to 'MinimumSpacing'.
When that layout rule is used the distance between points will not fall below this value.
The measurement type determines how the distance is measured.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The minimumDistance is too small.
Since:
2013

Autodesk.Revit.DB.DividedPath.Distance
The distance between points that are distributed along the path according to the selected layout.
When the layout is set to 'FixedDistance' this value can be set to desired distance.
The measurement type determines how the distance is measured.
Remarks:
This does not take into account points obtained by intersections with other elements.
When the layout is set to 'None' the distance is the value that would be used by the 'FixedDistance' layout.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The distance is too small.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The distance can only be set when the layout of this DividedPath is set to 'FixedDistance' or 'None'.
Since:
2013

Autodesk.Revit.DB.DividedPath.FixedNumberOfPoints
The number of points used when the layout is set to 'FixedNumber'.
Remarks:
To get the actual number of point use GetNumberOfPoints().
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: fixedNumberOfPoints must be at least 2 and at most 200.
Since:
2013

Autodesk.Revit.DB.DividedPath.MeasurementType
The measurement type determines how distances are calculated.
Either along a straight line between two points ('ChordLength')
or along the segment of the path that connects them. ('SegmentLength').
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: Invalid measurementType
-or-
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.DividedPath
An element that consists of a set of points distributed along a path which consists of a connected set of curves and edges.
Remarks:
The points can be the result of a uniform distribution along the path.
The type of the distribution is determined by a selected 'layout'.
The distance between the layout points depends on the path, the layout, and layout specific settings.
In addition, points can also be the result of intersecting the path with other elements.
Since:
2013